espressif/arduino-esp32/tools/ide-debug/svd/esp32c6.svd
        <register>
          <name>L1_CACHE_TAG_MEM_POWER_CTRL</name>
          <description>Cache tag memory power control register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00055555</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE0_TAG_MEM_FORCE_ON</name>
              <description>The bit is used to close clock gating of  L1-ICache0 tag memory. 1: close gating, 0: open clock gating.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_TAG_MEM_FORCE_PD</name>
              <description>The bit is used to power L1-ICache0 tag memory down. 0: follow rtc_lslp, 1: power down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_TAG_MEM_FORCE_PU</name>
              <description>The bit is used to power L1-ICache0 tag memory up. 0: follow rtc_lslp, 1: power up</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_TAG_MEM_FORCE_ON</name>
              <description>The bit is used to close clock gating of  L1-ICache1 tag memory. 1: close gating, 0: open clock gating.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_TAG_MEM_FORCE_PD</name>
              <description>The bit is used to power L1-ICache1 tag memory down. 0: follow rtc_lslp, 1: power down</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_TAG_MEM_FORCE_PU</name>
              <description>The bit is used to power L1-ICache1 tag memory up. 0: follow rtc_lslp, 1: power up</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_TAG_MEM_FORCE_ON</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_TAG_MEM_FORCE_PD</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_TAG_MEM_FORCE_PU</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_TAG_MEM_FORCE_ON</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_TAG_MEM_FORCE_PD</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_TAG_MEM_FORCE_PU</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_TAG_MEM_FORCE_ON</name>
              <description>The bit is used to close clock gating of  L1-Cache tag memory. 1: close gating, 0: open clock gating.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_TAG_MEM_FORCE_PD</name>
              <description>The bit is used to power L1-Cache tag memory down. 0: follow rtc_lslp, 1: power down</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_TAG_MEM_FORCE_PU</name>
              <description>The bit is used to power L1-Cache tag memory up. 0: follow rtc_lslp, 1: power up</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_DATA_MEM_POWER_CTRL</name>
          <description>Cache data memory power control register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00055555</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE0_DATA_MEM_FORCE_ON</name>
              <description>The bit is used to close clock gating of  L1-ICache0 data memory. 1: close gating, 0: open clock gating.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_DATA_MEM_FORCE_PD</name>
              <description>The bit is used to power L1-ICache0 data memory down. 0: follow rtc_lslp, 1: power down</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_DATA_MEM_FORCE_PU</name>
              <description>The bit is used to power L1-ICache0 data memory up. 0: follow rtc_lslp, 1: power up</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_DATA_MEM_FORCE_ON</name>
              <description>The bit is used to close clock gating of  L1-ICache1 data memory. 1: close gating, 0: open clock gating.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_DATA_MEM_FORCE_PD</name>
              <description>The bit is used to power L1-ICache1 data memory down. 0: follow rtc_lslp, 1: power down</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_DATA_MEM_FORCE_PU</name>
              <description>The bit is used to power L1-ICache1 data memory up. 0: follow rtc_lslp, 1: power up</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_DATA_MEM_FORCE_ON</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_DATA_MEM_FORCE_PD</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_DATA_MEM_FORCE_PU</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_DATA_MEM_FORCE_ON</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_DATA_MEM_FORCE_PD</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_DATA_MEM_FORCE_PU</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_DATA_MEM_FORCE_ON</name>
              <description>The bit is used to close clock gating of  L1-Cache data memory. 1: close gating, 0: open clock gating.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_DATA_MEM_FORCE_PD</name>
              <description>The bit is used to power L1-Cache data memory down. 0: follow rtc_lslp, 1: power down</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_DATA_MEM_FORCE_PU</name>
              <description>The bit is used to power L1-Cache data memory up. 0: follow rtc_lslp, 1: power up</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_FREEZE_CTRL</name>
          <description>Cache Freeze control register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_FREEZE_EN</name>
              <description>The bit is used to enable freeze operation on L1-ICache0. It can be cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_FREEZE_MODE</name>
              <description>The bit is used to configure mode of freeze operation L1-ICache0. 0: a miss-access will not stuck. 1: a miss-access will stuck.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_FREEZE_DONE</name>
              <description>The bit is used to indicate whether freeze operation on L1-ICache0 is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_FREEZE_EN</name>
              <description>The bit is used to enable freeze operation on L1-ICache1. It can be cleared by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_FREEZE_MODE</name>
              <description>The bit is used to configure mode of freeze operation L1-ICache1. 0: a miss-access will not stuck. 1: a miss-access will stuck.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_FREEZE_DONE</name>
              <description>The bit is used to indicate whether freeze operation on L1-ICache1 is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_FREEZE_EN</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_FREEZE_MODE</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_FREEZE_DONE</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_FREEZE_EN</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_FREEZE_MODE</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_FREEZE_DONE</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_FREEZE_EN</name>
              <description>The bit is used to enable freeze operation on L1-Cache. It can be cleared by software.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_FREEZE_MODE</name>
              <description>The bit is used to configure mode of freeze operation L1-Cache. 0: a miss-access will not stuck. 1: a miss-access will stuck.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_FREEZE_DONE</name>
              <description>The bit is used to indicate whether freeze operation on L1-Cache is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_DATA_MEM_ACS_CONF</name>
          <description>Cache data memory access configure register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00033333</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE0_DATA_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-ICache0 data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_DATA_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-ICache0 data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_DATA_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-ICache1 data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_DATA_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-ICache1 data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_DATA_MEM_RD_EN</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_DATA_MEM_WR_EN</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_DATA_MEM_RD_EN</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_DATA_MEM_WR_EN</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_DATA_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-Cache data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_DATA_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-Cache data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_CACHE_TAG_MEM_ACS_CONF</name>
          <description>Cache tag memory access configure register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00033333</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE0_TAG_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-ICache0 tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_TAG_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-ICache0 tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_TAG_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-ICache1 tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_TAG_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-ICache1 tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_TAG_MEM_RD_EN</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE2_TAG_MEM_WR_EN</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_TAG_MEM_RD_EN</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_TAG_MEM_WR_EN</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_CACHE_TAG_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L1-Cache tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_CACHE_TAG_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L1-Cache tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_PRELOCK_CONF</name>
          <description>L1 instruction Cache 0 prelock configure register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PRELOCK_SCT0_EN</name>
              <description>The bit is used to enable the first section of prelock function on L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_PRELOCK_SCT1_EN</name>
              <description>The bit is used to enable the second section of prelock function on L1-ICache0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_PRELOCK_RGID</name>
              <description>The bit is used to set  the gid of l1 icache0 prelock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_PRELOCK_SCT0_ADDR</name>
          <description>L1 instruction Cache 0 prelock section0 address configure register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PRELOCK_SCT0_ADDR</name>
              <description>Those bits are used to configure the start virtual address of the first section of prelock on L1-ICache0, which should be used together with L1_ICACHE0_PRELOCK_SCT0_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
