espressif/arduino-esp32/tools/ide-debug/svd/esp32c6.svd
        <register>
          <name>L2_CACHE_AUTOLOAD_CTRL</name>
          <description>L2 Cache autoload-operation control register</description>
          <addressOffset>0x2A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_ENA</name>
              <description>The bit is used to enable and disable autoload operation on L2-Cache.  1: enable, 0: disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_DONE</name>
              <description>The bit is used to indicate whether autoload operation on L2-Cache is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_ORDER</name>
              <description>The bit is used to configure the direction of autoload operation on L2-Cache. 0: ascending. 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_TRIGGER_MODE</name>
              <description>The field is used to configure trigger mode of autoload operation on L2-Cache. 0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT0_ENA</name>
              <description>The bit is used to enable the first section for autoload operation on L2-Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT1_ENA</name>
              <description>The bit is used to enable the second section for autoload operation on L2-Cache.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT2_ENA</name>
              <description>The bit is used to enable the third section for autoload operation on L2-Cache.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT3_ENA</name>
              <description>The bit is used to enable the fourth section for autoload operation on L2-Cache.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_RGID</name>
              <description>The bit is used to set  the gid of l2 cache autoload.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_SCT0_ADDR</name>
          <description>L2 Cache autoload section 0 address configure register</description>
          <addressOffset>0x2A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT0_ADDR</name>
              <description>Those bits are used to configure the start virtual address of the first section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT0_SIZE and L2_CACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_SCT0_SIZE</name>
          <description>L2 Cache autoload section 0 size configure register</description>
          <addressOffset>0x2A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT0_ADDR and L2_CACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_SCT1_ADDR</name>
          <description>L2 Cache autoload section 1 address configure register</description>
          <addressOffset>0x2AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT1_ADDR</name>
              <description>Those bits are used to configure the start virtual address of the second section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT1_SIZE and L2_CACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_SCT1_SIZE</name>
          <description>L2 Cache autoload section 1 size configure register</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT1_ADDR and L2_CACHE_AUTOLOAD_SCT1_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_SCT2_ADDR</name>
          <description>L2 Cache autoload section 2 address configure register</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT2_ADDR</name>
              <description>Those bits are used to configure the start virtual address of the third section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT2_SIZE and L2_CACHE_AUTOLOAD_SCT2_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_SCT2_SIZE</name>
          <description>L2 Cache autoload section 2 size configure register</description>
          <addressOffset>0x2B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT2_SIZE</name>
              <description>Those bits are used to configure the size of the third section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT2_ADDR and L2_CACHE_AUTOLOAD_SCT2_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_SCT3_ADDR</name>
          <description>L2 Cache autoload section 3 address configure register</description>
          <addressOffset>0x2BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT3_ADDR</name>
              <description>Those bits are used to configure the start virtual address of the fourth section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT3_SIZE and L2_CACHE_AUTOLOAD_SCT3_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_SCT3_SIZE</name>
          <description>L2 Cache autoload section 3 size configure register</description>
          <addressOffset>0x2C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT3_SIZE</name>
              <description>Those bits are used to configure the size of the fourth section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT3_ADDR and L2_CACHE_AUTOLOAD_SCT3_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_CNT_INT_ENA</name>
          <description>Cache Access Counter Interrupt enable register</description>
          <addressOffset>0x2C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS0_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in L2-Cache due to bus0 accesses L2-Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS1_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in L2-Cache due to bus1 accesses L2-Cache.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS2_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS3_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS0_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in L2-Cache due to bus0 accesses L2-Cache.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS1_OVF_INT_ENA</name>
              <description>The bit is used to enable interrupt of one of counters overflow that occurs in L2-Cache due to bus1 accesses L2-Cache.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS2_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS3_OVF_INT_ENA</name>
              <description>Reserved</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_CNT_INT_CLR</name>
          <description>Cache Access Counter Interrupt clear register</description>
          <addressOffset>0x2C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS0_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in L2-Cache due to bus0 accesses L2-Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS1_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in L2-Cache due to bus1 accesses L2-Cache.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS2_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS3_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS0_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in L2-Cache due to bus0 accesses L2-Cache.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS1_OVF_INT_CLR</name>
              <description>The bit is used to clear counters overflow interrupt and counters in L2-Cache due to bus1 accesses L2-Cache.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS2_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS3_OVF_INT_CLR</name>
              <description>Reserved</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_CNT_INT_RAW</name>
          <description>Cache Access Counter Interrupt raw register</description>
          <addressOffset>0x2CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS0_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache due to bus0 accesses L2-ICache0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS1_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache due to bus1 accesses L2-ICache1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS2_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache due to bus2 accesses L2-ICache2.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS3_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache due to bus3 accesses L2-ICache3.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS0_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache due to bus0 accesses L2-DCache.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS1_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache due to bus1 accesses L2-DCache.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS2_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache due to bus2 accesses L2-DCache.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS3_OVF_INT_RAW</name>
              <description>The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache due to bus3 accesses L2-DCache.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_CNT_INT_ST</name>
          <description>Cache Access Counter Interrupt status register</description>
          <addressOffset>0x2D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS0_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in L2-Cache due to bus0 accesses L2-Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS1_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in L2-Cache due to bus1 accesses L2-Cache.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS2_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS3_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS0_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in L2-Cache due to bus0 accesses L2-Cache.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS1_OVF_INT_ST</name>
              <description>The bit indicates the interrupt status of one of counters overflow that occurs in L2-Cache due to bus1 accesses L2-Cache.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS2_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS3_OVF_INT_ST</name>
              <description>Reserved</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_FAIL_INT_ENA</name>
          <description>Cache Access Fail Interrupt enable register</description>
          <addressOffset>0x2D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_FAIL_INT_ENA</name>
              <description>The bit is used to enable interrupt of access fail that occurs in L2-Cache due to l1 cache accesses L2-Cache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_FAIL_INT_CLR</name>
          <description>L1-Cache Access Fail Interrupt clear register</description>
          <addressOffset>0x2D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_FAIL_INT_CLR</name>
              <description>The bit is used to clear interrupt of access fail that occurs in L2-Cache due to l1 cache accesses L2-Cache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_FAIL_INT_RAW</name>
          <description>Cache Access Fail Interrupt raw register</description>
          <addressOffset>0x2DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_FAIL_INT_RAW</name>
              <description>The raw bit of the interrupt of access fail that occurs in L2-Cache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_ACS_FAIL_INT_ST</name>
          <description>Cache Access Fail Interrupt status register</description>
          <addressOffset>0x2E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_FAIL_INT_ST</name>
              <description>The bit indicates the interrupt status of access fail that occurs in L2-Cache due to l1 cache accesses L2-Cache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
