espressif/arduino-esp32/tools/ide-debug/svd/esp32c6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HP_APM</name>
      <description>Peripheral HP_APM</description>
      <groupName>HP_APM</groupName>
      <baseAddress>0x60099000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x114</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REGION_FILTER_EN</name>
          <description>Region filter enable register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>REGION_FILTER_EN</name>
              <description>Region filter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION0_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION0_ADDR_START</name>
              <description>Start address of region0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION0_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION0_ADDR_END</name>
              <description>End address of region0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION0_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION0_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION0_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION0_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION0_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION0_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION0_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION0_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION0_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION0_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION1_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION1_ADDR_START</name>
              <description>Start address of region1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION1_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION1_ADDR_END</name>
              <description>End address of region1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION1_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION1_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION1_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION1_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION1_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION1_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION1_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION1_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION1_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION1_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION2_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION2_ADDR_START</name>
              <description>Start address of region2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION2_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION2_ADDR_END</name>
              <description>End address of region2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION2_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION2_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION2_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION2_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION2_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION2_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION2_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION2_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION2_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION2_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION3_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION3_ADDR_START</name>
              <description>Start address of region3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION3_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION3_ADDR_END</name>
              <description>End address of region3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION3_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION3_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION3_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION3_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION3_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION3_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION3_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION3_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION3_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION3_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION4_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION4_ADDR_START</name>
              <description>Start address of region4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION4_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION4_ADDR_END</name>
              <description>End address of region4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION4_PMS_ATTR</name>
          <description>Region access authority attribute register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION4_R0_PMS_X</name>
              <description>Region execute authority in REE_MODE0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION4_R0_PMS_W</name>
              <description>Region write authority in REE_MODE0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION4_R0_PMS_R</name>
              <description>Region read authority in REE_MODE0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION4_R1_PMS_X</name>
              <description>Region execute authority in REE_MODE1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION4_R1_PMS_W</name>
              <description>Region write authority in REE_MODE1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION4_R1_PMS_R</name>
              <description>Region read authority in REE_MODE1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION4_R2_PMS_X</name>
              <description>Region execute authority in REE_MODE2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION4_R2_PMS_W</name>
              <description>Region write authority in REE_MODE2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGION4_R2_PMS_R</name>
              <description>Region read authority in REE_MODE2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION5_ADDR_START</name>
          <description>Region address register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGION5_ADDR_START</name>
              <description>Start address of region5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGION5_ADDR_END</name>
          <description>Region address register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>REGION5_ADDR_END</name>
              <description>End address of region5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
