espressif/arduino-esp32/tools/ide-debug/svd/esp32c6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PARL_IO</name>
      <description>Peripheral PARL_IO</description>
      <groupName>PARL_IO</groupName>
      <baseAddress>0x60015000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PARL_IO</name>
        <value>63</value>
      </interrupt>
      <registers>
        <register>
          <name>RX_CFG0</name>
          <description>Parallel RX module configuration register0.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_EOF_GEN_SEL</name>
              <description>Write 0 to select eof generated manchnism by configured data byte length. Write 1 to select eof generated manchnism by external enable signal.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_START</name>
              <description>Write 1 to start rx global data sampling.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DATA_BYTELEN</name>
              <description>Configures rx receieved data byte length.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SW_EN</name>
              <description>Write 1 to enable software data sampling.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PULSE_SUBMODE_SEL</name>
              <description>Pulse submode selection. 
0000: positive pulse start(data bit included) &amp;&amp;  positive pulse end(data bit included)
0001: positive pulse start(data bit included) &amp;&amp; positive pulse end (data bit excluded)
0010: positive pulse start(data bit excluded) &amp;&amp; positive pulse end (data bit included)
0011: positive pulse start(data bit excluded) &amp;&amp; positive pulse end (data bit excluded)
0100: positive pulse start(data bit included) &amp;&amp; length end
0101: positive pulse start(data bit excluded) &amp;&amp; length end
0110: negative pulse start(data bit included) &amp;&amp;  negative pulse end(data bit included)
0111: negative pulse start(data bit included) &amp;&amp; negative pulse end (data bit excluded)
1000: negative pulse start(data bit excluded) &amp;&amp; negative pulse end (data bit included)
1001: negative pulse start(data bit excluded) &amp;&amp; negative pulse end (data bit excluded)
1010: negative pulse start(data bit included) &amp;&amp; length end
1011: negative pulse start(data bit excluded) &amp;&amp; length end</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_LEVEL_SUBMODE_SEL</name>
              <description>Write 0 to sample data at high level of external enable signal. Write 1 to sample data at low level of external enable signal.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SMP_MODE_SEL</name>
              <description>Rx data sampling mode selection. 
000: external level enable mode
001: external pulse enable mode  
010: internal software enable mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CLK_EDGE_SEL</name>
              <description>Write 0 to enable sampling data on the rising edge of rx clock. Write 0 to enable sampling data on the falling edge of rx clock.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BIT_PACK_ORDER</name>
              <description>Write 0 to pack bits into 1byte from MSB when data bus width is 4/2/1 bits. Write 0 to pack bits into 1byte from LSB when data bus width is 4/2/1 bits.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BUS_WID_SEL</name>
              <description>Rx data bus width selection. 
100: bus width is 1 bit 
011: bus width is 2 bits 
010: bus width is 4 bits
001: bus width is 8 bits
000: bus width is 16 bits</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FIFO_SRST</name>
              <description>Write 1 to enable soft reset of async fifo in rx module.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CFG1</name>
          <description>Parallel RX module configuration register1.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0FFFF008</resetValue>
          <fields>
            <field>
              <name>RX_REG_UPDATE</name>
              <description>Write 1 to update rx register configuration signals.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_TIMEOUT_EN</name>
              <description>Write 1 to enable timeout count to generate error eof.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_EXT_EN_SEL</name>
              <description>Configures rx external enable signal selection from 16 data lines.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TIMEOUT_THRESHOLD</name>
              <description>Configures rx threshold of timeout counter.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CFG0</name>
          <description>Parallel TX module configuration register0.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_BYTELEN</name>
              <description>Configures tx sending data byte length.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_GATING_EN</name>
              <description>Write 1 to enable output tx clock gating.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_START</name>
              <description>Write 1 to start tx global data output.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HW_VALID_EN</name>
              <description>Write 1 to enable tx hardware data valid signal.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SMP_EDGE_SEL</name>
              <description>Write 0 to enable sampling data on the rising edge of tx clock. Write 0 to enable sampling data on the falling edge of tx clock.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_BIT_UNPACK_ORDER</name>
              <description>Write 0 to unpack bits from 1byte from MSB when data bus width is 4/2/1 bits. Write 0 to unpack bits from 1byte from LSB when data bus width is 4/2/1 bits.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_BUS_WID_SEL</name>
              <description>Tx data bus width selection. 
100: bus width is 1 bit
011: bus width is 2 bits
010: bus width is 4 bits
001: bus width is 8 bits
000: bus width is 16 bits</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_FIFO_SRST</name>
              <description>Write 1 to enable soft reset of async fifo in tx module.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_CFG1</name>
          <description>Parallel TX module configuration register1.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_IDLE_VALUE</name>
              <description>Configures data value on tx bus when IDLE state.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST</name>
          <description>Parallel IO module status register0.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_READY</name>
              <description>Represents the status that tx is ready.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Parallel IO interrupt enable singal configuration register.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_FIFO_REMPTY_INT_ENA</name>
              <description>Write 1 to enable TX_FIFO_REMPTY_INTR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FIFO_WFULL_INT_ENA</name>
              <description>Write 1 to enable RX_FIFO_WFULL_INTR.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_EOF_INT_ENA</name>
              <description>Write 1 to enable TX_EOF_INTR.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Parallel IO interrupt raw singal status register.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_FIFO_REMPTY_INT_RAW</name>
              <description>The raw interrupt status of TX_FIFO_REMPTY_INTR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_FIFO_WFULL_INT_RAW</name>
              <description>The raw interrupt status of RX_FIFO_WFULL_INTR.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_EOF_INT_RAW</name>
              <description>The raw interrupt status of TX_EOF_INTR.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Parallel IO interrupt singal status register.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_FIFO_REMPTY_INT_ST</name>
              <description>The masked interrupt status of TX_FIFO_REMPTY_INTR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_FIFO_WFULL_INT_ST</name>
              <description>The masked interrupt status of RX_FIFO_WFULL_INTR.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_EOF_INT_ST</name>
              <description>The masked interrupt status of TX_EOF_INTR.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Parallel IO interrupt  clear singal configuration register.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_FIFO_REMPTY_INT_CLR</name>
              <description>Write 1 to clear TX_FIFO_REMPTY_INTR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_FIFO_WFULL_INT_CLR</name>
              <description>Write 1 to clear RX_FIFO_WFULL_INTR.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_EOF_INT_CLR</name>
              <description>Write 1 to clear TX_EOF_INTR.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>Parallel IO clk configuration register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Force clock on for this register file</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version register.</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02202240</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version of this register file</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
