espressif/arduino-esp32/tools/ide-debug/svd/esp32c6.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <description>UART (Universal Asynchronous Receiver-Transmitter) Controller</description>
      <baseAddress>0x60001000</baseAddress>
      <interrupt>
        <name>UART1</name>
        <value>44</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>UHCI0</name>
      <description>Universal Host Controller Interface</description>
      <groupName>UHCI</groupName>
      <baseAddress>0x60005000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x84</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UHCI0</name>
        <value>42</value>
      </interrupt>
      <registers>
        <register>
          <name>CONF0</name>
          <description>UHCI Configuration Register0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x000006E0</resetValue>
          <fields>
            <field>
              <name>TX_RST</name>
              <description>Write 1 then write 0 to this bit to reset decode state machine.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_RST</name>
              <description>Write 1 then write 0 to this bit to reset encode state machine.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_CE</name>
              <description>Set this bit to link up HCI and UART0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_CE</name>
              <description>Set this bit to link up HCI and UART1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_EN</name>
              <description>Set this bit to separate the data frame using a special char.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEAD_EN</name>
              <description>Set this bit to encode the data packet with a formatting header.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_REC_EN</name>
              <description>Set this bit to enable UHCI to receive the 16 bit CRC.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_IDLE_EOF_EN</name>
              <description>If this bit is set to 1 UHCI will end the payload receiving process when UART has been in idle state.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEN_EOF_EN</name>
              <description>If this bit is set to 1 UHCI decoder receiving payload data is end when the receiving byte count has reached the specified value. The value is payload length indicated by UHCI packet header when UHCI_HEAD_EN is 1 or the value is configuration value when UHCI_HEAD_EN is 0. If this bit is set to 0 UHCI decoder receiving payload data is end when 0xc0 is received.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCODE_CRC_EN</name>
              <description>Set this bit to enable data integrity checking by appending a 16 bit CCITT-CRC to end of the payload.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>1'b1: Force clock on for register. 1'b0: Support clock only when application writes registers.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART_RX_BRK_EOF_EN</name>
              <description>If this bit is set to 1 UHCI will end payload receive process when NULL frame is received by UART.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>UHCI Interrupt Raw Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_START_INT_RAW</name>
              <description>Indicates the raw interrupt of UHCI_RX_START_INT. Interrupt will be triggered when delimiter is sent successfully.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_START_INT_RAW</name>
              <description>Indicates the raw interrupt of UHCI_TX_START_INT. Interrupt will be triggered when DMA detects delimiter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_HUNG_INT_RAW</name>
              <description>Indicates the raw interrupt of UHCI_RX_HUNG_INT. Interrupt will be triggered when the required time of DMA receiving data  exceeds the configuration value.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_HUNG_INT_RAW</name>
              <description>Indicates the raw interrupt of UHCI_TX_HUNG_INT. Interrupt will be triggered when the required time of DMA reading RAM data  exceeds the configuration value.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEND_S_REG_Q_INT_RAW</name>
              <description>Indicates the raw interrupt of UHCI_SEND_S_REG_Q_INT. Interrupt will be triggered when UHCI sends short packet successfully with single_send mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEND_A_REG_Q_INT_RAW</name>
              <description>Indicates the raw interrupt of UHCI_SEND_A_REG_Q_INT. Interrupt will be triggered when UHCI sends short packet successfully with always_send mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_EOF_INT_RAW</name>
              <description>Indicates the raw interrupt of UHCI_OUT_EOF_INT. Interrupt will be triggered when there are errors in EOF.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_CTRL0_INT_RAW</name>
              <description>Indicates the raw interrupt of UHCI_APP_CTRL0_INT. Interrupt will be triggered when UHCI_APP_CTRL0_IN_SET is set to 1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CTRL1_INT_RAW</name>
              <description>Indicates the raw interrupt of UHCI_APP_CTRL1_INT. Interrupt will be triggered when UHCI_APP_CTRL1_IN_SET is set to 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>UHCI Interrupt Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_START_INT_ST</name>
              <description>Indicates the interrupt status of UHCI_RX_START_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_START_INT_ST</name>
              <description>Indicates the interrupt status of UHCI_TX_START_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_HUNG_INT_ST</name>
              <description>Indicates the interrupt status of UHCI_RX_HUNG_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_HUNG_INT_ST</name>
              <description>Indicates the interrupt status of UHCI_TX_HUNG_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEND_S_REG_Q_INT_ST</name>
              <description>Indicates the interrupt status of UHCI_SEND_S_REG_Q_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEND_A_REG_Q_INT_ST</name>
              <description>Indicates the interrupt status of UHCI_SEND_A_REG_Q_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTLINK_EOF_ERR_INT_ST</name>
              <description>Indicates the interrupt status of UHCI_OUT_EOF_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_CTRL0_INT_ST</name>
              <description>Indicates the interrupt status of UHCI_APP_CTRL0_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APP_CTRL1_INT_ST</name>
              <description>Indicates the interrupt status of UHCI_APP_CTRL1_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>UHCI Interrupt Enable Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_START_INT_ENA</name>
              <description>Set this bit to enable the interrupt of UHCI_RX_START_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_START_INT_ENA</name>
              <description>Set this bit to enable the interrupt of UHCI_TX_START_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_HUNG_INT_ENA</name>
              <description>Set this bit to enable the interrupt of UHCI_RX_HUNG_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HUNG_INT_ENA</name>
              <description>Set this bit to enable the interrupt of UHCI_TX_HUNG_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_S_REG_Q_INT_ENA</name>
              <description>Set this bit to enable the interrupt of UHCI_SEND_S_REG_Q_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_A_REG_Q_INT_ENA</name>
              <description>Set this bit to enable the interrupt of UHCI_SEND_A_REG_Q_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTLINK_EOF_ERR_INT_ENA</name>
              <description>Set this bit to enable the interrupt of UHCI_OUT_EOF_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CTRL0_INT_ENA</name>
              <description>Set this bit to enable the interrupt of UHCI_APP_CTRL0_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APP_CTRL1_INT_ENA</name>
              <description>Set this bit to enable the interrupt of UHCI_APP_CTRL1_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>UHCI Interrupt Clear Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_START_INT_CLR</name>
              <description>Set this bit to clear the raw interrupt of UHCI_RX_START_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_START_INT_CLR</name>
              <description>Set this bit to clear the raw interrupt of UHCI_TX_START_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_HUNG_INT_CLR</name>
              <description>Set this bit to clear the raw interrupt of UHCI_RX_HUNG_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_HUNG_INT_CLR</name>
              <description>Set this bit to clear the raw interrupt of UHCI_TX_HUNG_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEND_S_REG_Q_INT_CLR</name>
              <description>Set this bit to clear the raw interrupt of UHCI_SEND_S_REG_Q_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SEND_A_REG_Q_INT_CLR</name>
              <description>Set this bit to clear the raw interrupt of UHCI_SEND_A_REG_Q_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_EOF_ERR_INT_CLR</name>
              <description>Set this bit to clear the raw interrupt of UHCI_OUT_EOF_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APP_CTRL0_INT_CLR</name>
              <description>Set this bit to clear the raw interrupt of UHCI_APP_CTRL0_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APP_CTRL1_INT_CLR</name>
              <description>Set this bit to clear the raw interrupt of UHCI_APP_CTRL1_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF1</name>
          <description>UHCI Configuration Register1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000033</resetValue>
          <fields>
            <field>
              <name>CHECK_SUM_EN</name>
              <description>Set this bit to enable head checksum check when receiving.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHECK_SEQ_EN</name>
              <description>Set this bit to  enable sequence number check when receiving.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_DISABLE</name>
              <description>Set this bit to support CRC calculation, and data integrity check bit should 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAVE_HEAD</name>
              <description>Set this bit to save data packet head when UHCI receive data.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CHECK_SUM_RE</name>
              <description>Set this bit to encode data packet with checksum.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ACK_NUM_RE</name>
              <description>Set this bit to encode data packet with ACK when reliable data packet is ready.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_SW_START</name>
              <description>Set this bit to enable UHCI encoder transfer to ST_SW_WAIT status.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_START</name>
              <description>Set this bit to transmit data packet if UCHI_ENCODE_STATE is ST_SW_WAIT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE0</name>
          <description>UHCI Receive Status Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_ERR_CAUSE</name>
              <description>Indicates the error types when DMA receives the error frame. 3'b001: UHCI packet checksum error. 3'b010: UHCI packet sequence number error. 3'b011: UHCI packet CRC bit error. 3'b100: find 0xC0, but received packet is uncompleted. 3'b101: 0xC0 is not found, but received packet is completed. 3'b110: CRC check error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECODE_STATE</name>
              <description>Indicates UHCI decoder status.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE1</name>
          <description>UHCI Transmit Status Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENCODE_STATE</name>
              <description>Indicates UHCI encoder status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
