espressif/arduino-esp32/tools/ide-debug/svd/esp32c6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB_DEVICE</name>
      <description>Full-speed USB Serial/JTAG Controller</description>
      <groupName>USB_DEVICE</groupName>
      <baseAddress>0x6000F000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB</name>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>EP1</name>
          <description>FIFO access for the CDC-ACM data IN and OUT endpoints.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_RDWR_BYTE</name>
              <description>Write and read byte data to/from UART Tx/Rx FIFO through this field. When USB_DEVICE_SERIAL_IN_EMPTY_INT is set, then user can write data (up to 64 bytes) into UART Tx FIFO. When USB_DEVICE_SERIAL_OUT_RECV_PKT_INT is set, user can check USB_DEVICE_OUT_EP1_WR_ADDR USB_DEVICE_OUT_EP0_RD_ADDR to know how many data is received, then read data from UART Rx FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EP1_CONF</name>
          <description>Configuration and control registers for the CDC-ACM FIFOs.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_WR_DONE</name>
              <description>Set this bit to indicate writing byte data to UART Tx FIFO is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_IN_EP_DATA_FREE</name>
              <description>1'b1: Indicate UART Tx FIFO is not full and can write data into in. After writing USB_DEVICE_WR_DONE, this bit would be 0 until data in UART Tx FIFO is read by USB Host.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_OUT_EP_DATA_AVAIL</name>
              <description>1'b1: Indicate there is data in UART Rx FIFO.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Interrupt raw status register.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_JTAG_IN_FLUSH_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when flush cmd is received for IN endpoint 2 of JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SOF_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when SOF frame is received.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_OUT_RECV_PKT_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when Serial Port OUT Endpoint received one packet.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_IN_EMPTY_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when Serial Port IN Endpoint is empty.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_PID_ERR_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when pid error is detected.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_CRC5_ERR_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when CRC5 error is detected.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_CRC16_ERR_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when CRC16 error is detected.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_STUFF_ERR_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when stuff error is detected.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_TOKEN_REC_IN_EP1_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when IN token for IN endpoint 1 is received.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_USB_BUS_RESET_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when usb bus reset is detected.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP1_ZERO_PAYLOAD_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when OUT endpoint 1 received packet with zero palyload.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP2_ZERO_PAYLOAD_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when OUT endpoint 2 received packet with zero palyload.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_RTS_CHG_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when level of RTS from usb serial channel is changed.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_DTR_CHG_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when level of DTR from usb serial channel is changed.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_GET_LINE_CODE_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when level of GET LINE CODING request is received.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SET_LINE_CODE_INT_RAW</name>
              <description>The raw interrupt bit turns to high level when level of SET LINE CODING request is received.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Interrupt status register.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_JTAG_IN_FLUSH_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_JTAG_IN_FLUSH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SOF_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_SOF_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_OUT_RECV_PKT_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_SERIAL_OUT_RECV_PKT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_IN_EMPTY_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_SERIAL_IN_EMPTY_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_PID_ERR_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_PID_ERR_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_CRC5_ERR_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_CRC5_ERR_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_CRC16_ERR_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_CRC16_ERR_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_STUFF_ERR_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_STUFF_ERR_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_TOKEN_REC_IN_EP1_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_USB_BUS_RESET_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_USB_BUS_RESET_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP1_ZERO_PAYLOAD_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP2_ZERO_PAYLOAD_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_RTS_CHG_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_RTS_CHG_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_DTR_CHG_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_DTR_CHG_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_GET_LINE_CODE_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_GET_LINE_CODE_INT interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SET_LINE_CODE_INT_ST</name>
              <description>The raw interrupt status bit for the USB_DEVICE_SET_LINE_CODE_INT interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable status register.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_JTAG_IN_FLUSH_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_JTAG_IN_FLUSH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SOF_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_SOF_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_OUT_RECV_PKT_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_SERIAL_OUT_RECV_PKT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_IN_EMPTY_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_SERIAL_IN_EMPTY_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_PID_ERR_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_PID_ERR_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_CRC5_ERR_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_CRC5_ERR_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_CRC16_ERR_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_CRC16_ERR_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_STUFF_ERR_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_STUFF_ERR_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_TOKEN_REC_IN_EP1_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_IN_TOKEN_REC_IN_EP1_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_USB_BUS_RESET_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_USB_BUS_RESET_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP1_ZERO_PAYLOAD_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP2_ZERO_PAYLOAD_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_RTS_CHG_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_RTS_CHG_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_DTR_CHG_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_DTR_CHG_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_GET_LINE_CODE_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_GET_LINE_CODE_INT interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SET_LINE_CODE_INT_ENA</name>
              <description>The interrupt enable bit for the USB_DEVICE_SET_LINE_CODE_INT interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
