espressif/arduino-esp32/tools/ide-debug/svd/esp32c6.svd
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear status register.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_JTAG_IN_FLUSH_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_JTAG_IN_FLUSH_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SOF_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_JTAG_SOF_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_OUT_RECV_PKT_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_SERIAL_OUT_RECV_PKT_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SERIAL_IN_EMPTY_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_SERIAL_IN_EMPTY_INT interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_PID_ERR_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_PID_ERR_INT interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_CRC5_ERR_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_CRC5_ERR_INT interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_CRC16_ERR_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_CRC16_ERR_INT interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_STUFF_ERR_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_STUFF_ERR_INT interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_TOKEN_REC_IN_EP1_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_IN_TOKEN_IN_EP1_INT interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_USB_BUS_RESET_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_USB_BUS_RESET_INT interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP1_ZERO_PAYLOAD_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_OUT_EP1_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP2_ZERO_PAYLOAD_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_OUT_EP2_ZERO_PAYLOAD_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_RTS_CHG_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_RTS_CHG_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_DTR_CHG_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_DTR_CHG_INT interrupt.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_GET_LINE_CODE_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_GET_LINE_CODE_INT interrupt.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_SET_LINE_CODE_INT_CLR</name>
              <description>Set this bit to clear the USB_DEVICE_SET_LINE_CODE_INT interrupt.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF0</name>
          <description>PHY hardware configuration.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004200</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_PHY_SEL</name>
              <description>Select internal/external PHY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_EXCHG_PINS_OVERRIDE</name>
              <description>Enable software control USB D+ D- exchange</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_EXCHG_PINS</name>
              <description>USB D+ D- exchange</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_VREFH</name>
              <description>Control single-end input high threshold,1.76V to 2V, step 80mV</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_VREFL</name>
              <description>Control single-end input low threshold,0.8V to 1.04V, step 80mV</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_VREF_OVERRIDE</name>
              <description>Enable software control input  threshold</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_PAD_PULL_OVERRIDE</name>
              <description>Enable software control USB D+ D- pullup pulldown</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_DP_PULLUP</name>
              <description>Control USB D+ pull up.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_DP_PULLDOWN</name>
              <description>Control USB D+ pull down.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_DM_PULLUP</name>
              <description>Control USB D- pull up.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_DM_PULLDOWN</name>
              <description>Control USB D- pull down.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_PULLUP_VALUE</name>
              <description>Control pull up value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_USB_PAD_ENABLE</name>
              <description>Enable USB pad function.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_USB_JTAG_BRIDGE_EN</name>
              <description>Set this bit usb_jtag, the connection between usb_jtag and internal JTAG is disconnected, and MTMS, MTDI, MTCK are output through GPIO Matrix, MTDO is input through GPIO Matrix.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>Registers used for debugging the PHY.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000030</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_TEST_ENABLE</name>
              <description>Enable test of the USB pad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_TEST_USB_OE</name>
              <description>USB pad oen in test</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_TEST_TX_DP</name>
              <description>USB D+ tx value in test</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_TEST_TX_DM</name>
              <description>USB D- tx value in test</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_TEST_RX_RCV</name>
              <description>USB RCV value in test</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_TEST_RX_DP</name>
              <description>USB D+ rx value in test</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_TEST_RX_DM</name>
              <description>USB D- rx value in test</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JFIFO_ST</name>
          <description>JTAG FIFO status and control registers.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000044</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_IN_FIFO_CNT</name>
              <description>JTAT in fifo counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_FIFO_EMPTY</name>
              <description>1: JTAG in fifo is empty.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_FIFO_FULL</name>
              <description>1: JTAG in fifo is full.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_FIFO_CNT</name>
              <description>JTAT out fifo counter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_FIFO_EMPTY</name>
              <description>1: JTAG out fifo is empty.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_FIFO_FULL</name>
              <description>1: JTAG out fifo is full.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_FIFO_RESET</name>
              <description>Write 1 to reset JTAG in fifo.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_FIFO_RESET</name>
              <description>Write 1 to reset JTAG out fifo.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAM_NUM</name>
          <description>Last received SOF frame index register.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_SOF_FRAME_INDEX</name>
              <description>Frame index of received SOF frame.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_EP0_ST</name>
          <description>Control IN endpoint status information.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP0_STATE</name>
              <description>State of IN Endpoint 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP0_WR_ADDR</name>
              <description>Write data address of IN endpoint 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP0_RD_ADDR</name>
              <description>Read data address of IN endpoint 0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_EP1_ST</name>
          <description>CDC-ACM IN endpoint status information.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP1_STATE</name>
              <description>State of IN Endpoint 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP1_WR_ADDR</name>
              <description>Write data address of IN endpoint 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP1_RD_ADDR</name>
              <description>Read data address of IN endpoint 1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_EP2_ST</name>
          <description>CDC-ACM interrupt IN endpoint status information.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP2_STATE</name>
              <description>State of IN Endpoint 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP2_WR_ADDR</name>
              <description>Write data address of IN endpoint 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP2_RD_ADDR</name>
              <description>Read data address of IN endpoint 2.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_EP3_ST</name>
          <description>JTAG IN endpoint status information.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP3_STATE</name>
              <description>State of IN Endpoint 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP3_WR_ADDR</name>
              <description>Write data address of IN endpoint 3.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_IN_EP3_RD_ADDR</name>
              <description>Read data address of IN endpoint 3.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_EP0_ST</name>
          <description>Control OUT endpoint status information.</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP0_STATE</name>
              <description>State of OUT Endpoint 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP0_WR_ADDR</name>
              <description>Write data address of OUT endpoint 0. When USB_DEVICE_SERIAL_OUT_RECV_PKT_INT is detected, there are USB_DEVICE_OUT_EP0_WR_ADDR-2 bytes data in OUT EP0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP0_RD_ADDR</name>
              <description>Read data address of OUT endpoint 0.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_EP1_ST</name>
          <description>CDC-ACM OUT endpoint status information.</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP1_STATE</name>
              <description>State of OUT Endpoint 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP1_WR_ADDR</name>
              <description>Write data address of OUT endpoint 1. When USB_DEVICE_SERIAL_OUT_RECV_PKT_INT is detected, there are USB_DEVICE_OUT_EP1_WR_ADDR-2 bytes data in OUT EP1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP1_RD_ADDR</name>
              <description>Read data address of OUT endpoint 1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_OUT_EP1_REC_DATA_CNT</name>
              <description>Data count in OUT endpoint 1 when one packet is received.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
